mamedev/mame/src/emu/cpu/tms32025/tms32025.c
UINT16 tms32025_device::M_RDRAM(offs_t addr)
{
	UINT16 *ram;
	addr &= 0xffff;
	ram = m_datamap[addr >> 7];
	if (ram) return ram[addr & 0x7f];
	return m_data->read_word(addr << 1);
}

void tms32025_device::M_WRTRAM(offs_t addr, UINT16 data)
{
	UINT16 *ram;
	addr &= 0xffff;
	ram = m_datamap[addr >> 7];
	if (ram) {
		ram[addr & 0x7f] = data;
		if(addr == 1 && ram == m_intRAM && TXM) {
			if(FSM)
				m_waiting_for_serial_frame = 1;
			else
				m_IFR |= 0x20;
		}
	}
	else m_data->write_word(addr << 1, data);
}


UINT16 tms32025_device::reverse_carry_add(UINT16 arg0, UINT16 arg1 )
{
	UINT16 result = 0;
	int carry = 0;
	int count;
	for( count=0; count<16; count++ )
	{
		int sum = (arg0>>15)+(arg1>>15)+carry;
		result = (result<<1)|(sum&1);
		carry = sum>>1;
		arg0<<=1;
		arg1<<=1;
	}
	return result;
}

void tms32025_device::MODIFY_AR_ARP()
{ /* modify address register referenced by ARP */
	switch (m_opcode.b.l & 0x70)        /* Cases ordered by predicted useage */
	{
		case 0x00: /* 000   nop      */
			break;

		case 0x10: /* 001   *-       */
			m_AR[ARP] -- ;
			break;

		case 0x20: /* 010   *+       */
			m_AR[ARP] ++ ;
			break;

		case 0x30: /* 011   reserved */
			break;

		case 0x40: /* 100   *BR0-    */
			m_AR[ARP] = reverse_carry_add(m_AR[ARP],-m_AR[0]);
			break;

		case 0x50: /* 101   *0-      */
			m_AR[ARP] -= m_AR[0];
			break;

		case 0x60: /* 110   *0+      */
			m_AR[ARP] += m_AR[0];
			break;

		case 0x70: /* 111   *BR0+    */
			m_AR[ARP] += reverse_carry_add(m_AR[ARP],m_AR[0]);
			break;
	}

	if( !m_mHackIgnoreARP )
	{
		if (m_opcode.b.l & 8)
		{ /* bit 3 determines if new value is loaded into ARP */
			MODIFY_ARP((m_opcode.b.l & 7) );
		}
	}
}

void tms32025_device::CALCULATE_ADD_CARRY()
{
	if ( (UINT32)(m_oldacc.d) > (UINT32)(m_ACC.d) ) {
		SET1(C_FLAG);
	}
	else {
		CLR1(C_FLAG);
	}
}

void tms32025_device::CALCULATE_SUB_CARRY()
{
	if ( (UINT32)(m_oldacc.d) < (UINT32)(m_ACC.d) ) {
		CLR1(C_FLAG);
	}
	else {
		SET1(C_FLAG);
	}
}

void tms32025_device::CALCULATE_ADD_OVERFLOW(INT32 addval)
{
	if ((INT32)((m_ACC.d ^ addval) & (m_oldacc.d ^ m_ACC.d)) < 0)
	{
		SET0(OV_FLAG);
		if (OVM)
		{
			m_ACC.d = ((INT32)m_oldacc.d < 0) ? 0x80000000 : 0x7fffffff;
		}
	}
}
void tms32025_device::CALCULATE_SUB_OVERFLOW(INT32 subval)
{
	if ((INT32)((m_oldacc.d ^ subval) & (m_oldacc.d ^ m_ACC.d)) < 0)
	{
		SET0(OV_FLAG);
		if (OVM)
		{
			m_ACC.d = ((INT32)m_oldacc.d < 0) ? 0x80000000 : 0x7fffffff;
		}
	}
}

UINT16 tms32025_device::POP_STACK()
{
	UINT16 data = m_STACK[7];
	m_STACK[7] = m_STACK[6];
	m_STACK[6] = m_STACK[5];
	m_STACK[5] = m_STACK[4];
	m_STACK[4] = m_STACK[3];
	m_STACK[3] = m_STACK[2];
	m_STACK[2] = m_STACK[1];
	m_STACK[1] = m_STACK[0];
	return data;
}
void tms32025_device::PUSH_STACK(UINT16 data)
{
	m_STACK[0] = m_STACK[1];
	m_STACK[1] = m_STACK[2];
	m_STACK[2] = m_STACK[3];
	m_STACK[3] = m_STACK[4];
	m_STACK[4] = m_STACK[5];
	m_STACK[5] = m_STACK[6];
	m_STACK[6] = m_STACK[7];
	m_STACK[7] = data;
}

void tms32025_device::SHIFT_Preg_TO_ALU()
{
	switch(PM)      /* PM (in STR1) is the shift mode for Preg */
	{
		case 0:     m_ALU.d = m_Preg.d; break;
		case 1:     m_ALU.d = (m_Preg.d << 1); break;
		case 2:     m_ALU.d = (m_Preg.d << 4); break;
		case 3:     m_ALU.d = (m_Preg.d >> 6); if (m_Preg.d & 0x80000000) m_ALU.d |= 0xfc000000; break;
		default:    break;
	}
}

void tms32025_device::GETDATA(int shift,int signext)
{
	if (m_opcode.b.l & 0x80)
	{ /* indirect memory access */
		m_memaccess = IND;
	}
	else
	{ /* direct memory address */
		m_memaccess = DMA;
	}

	if (m_memaccess >= 0x800)
	{
		m_external_mem_access = 1;  /* Pause if hold pin is active */
	}
	else
	{
		m_external_mem_access = 0;
	}

	m_ALU.d = (UINT16)M_RDRAM(m_memaccess);
	if (signext) m_ALU.d = (INT16)m_ALU.d;
	m_ALU.d <<= shift;

	/* next ARP */
	if (m_opcode.b.l & 0x80) MODIFY_AR_ARP();
}

void tms32025_device::PUTDATA(UINT16 data)
{
	if (m_opcode.b.l & 0x80) {
		if (m_memaccess >= 0x800) m_external_mem_access = 1;    /* Pause if hold pin is active */
		else m_external_mem_access = 0;

		M_WRTRAM(IND, data);
		MODIFY_AR_ARP();
	}
	else {
		if (m_memaccess >= 0x800) m_external_mem_access = 1;    /* Pause if hold pin is active */
		else m_external_mem_access = 0;

		M_WRTRAM(DMA, data);
	}
}
void tms32025_device::PUTDATA_SST(UINT16 data)
{
	if (m_opcode.b.l & 0x80) m_memaccess = IND;
	else m_memaccess = DMApg0;

	if (m_memaccess >= 0x800) m_external_mem_access = 1;        /* Pause if hold pin is active */
	else m_external_mem_access = 0;

	if (m_opcode.b.l & 0x80) {
		m_opcode.b.l &= 0xf7;                   /* Stop ARP changes */
		MODIFY_AR_ARP();
	}
	M_WRTRAM(m_memaccess, data);
}



/****************************************************************************
 *  Emulate the Instructions
 ****************************************************************************/

/* The following functions are here to fill the void for the */
/* opcode call functions. These functions are never actually called. */
void tms32025_device::opcodes_CE() { fatalerror("Should never get here!\n"); }
void tms32025_device::opcodes_Dx() { fatalerror("Should never get here!\n"); }

void tms32025_device::illegal()
{
	logerror("TMS32025:  PC = %04x,  Illegal opcode = %04x\n", (m_PC-1), m_opcode.w.l);
}

void tms32025_device::abst()
{
	if ( (INT32)(m_ACC.d) < 0 ) {
		m_ACC.d = -m_ACC.d;
		if (m_ACC.d == 0x80000000) {
			SET0(OV_FLAG);
			if (OVM) m_ACC.d-- ;
		}
	}
	CLR1(C_FLAG);
}
void tms32025_device::add()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_opcode.b.h & 0xf), SXM);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::addc()
{
	m_oldacc.d = m_ACC.d;
	GETDATA(0, 0);
	if (CARRY) m_ACC.d++;
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	if (m_ACC.d == m_oldacc.d) {}   /* edge case, carry remains same */
	else CALCULATE_ADD_CARRY();
}
void tms32025_device::addh()
{
	m_oldacc.d = m_ACC.d;
	GETDATA(0, 0);
	m_ACC.w.h += m_ALU.w.l;
	if ( (UINT16)(m_oldacc.w.h) > (UINT16)(m_ACC.w.h) ) {
		SET1(C_FLAG); /* Carry flag is not cleared, if no carry occurred */
	}
	if ((INT16)((m_ACC.w.h ^ m_ALU.w.l) & (m_oldacc.w.h ^ m_ACC.w.h)) < 0) {
		SET0(OV_FLAG);
		if (OVM) m_ACC.w.h = ((INT16)m_oldacc.w.h < 0) ? 0x8000 : 0x7fff;
	}
}
void tms32025_device::addk()
{
	m_oldacc.d = m_ACC.d;
	m_ALU.d = (UINT8)m_opcode.b.l;
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::adds()
{
	m_oldacc.d = m_ACC.d;
	GETDATA(0, 0);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::addt()
{
	m_oldacc.d = m_ACC.d;
	GETDATA((m_Treg & 0xf), SXM);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::adlk()
{
	m_oldacc.d = m_ACC.d;
	if (SXM) m_ALU.d =  (INT16)M_RDOP_ARG(m_PC);
	else     m_ALU.d = (UINT16)M_RDOP_ARG(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::adrk()
{
	m_AR[ARP] += m_opcode.b.l;
}
void tms32025_device::and_()
{
	GETDATA(0, 0);
	m_ACC.d &= m_ALU.d;
}
void tms32025_device::andk()
{
	m_oldacc.d = m_ACC.d;
	m_ALU.d = (UINT16)M_RDOP_ARG(m_PC);
	m_PC++;
	m_ALU.d <<= (m_opcode.b.h & 0xf);
	m_ACC.d &= m_ALU.d;
}
void tms32025_device::apac()
{
	m_oldacc.d = m_ACC.d;
	SHIFT_Preg_TO_ALU();
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
	CALCULATE_ADD_CARRY();
}
void tms32025_device::br()
{
	SET_PC(M_RDOP_ARG(m_PC));
	MODIFY_AR_ARP();
}
void tms32025_device::bacc()
{
	SET_PC(m_ACC.w.l);
}
void tms32025_device::banz()
{
	if (m_AR[ARP]) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bbnz()
{
	if (TC) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bbz()
{
	if (TC == 0) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bc()
{
	if (CARRY) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bgez()
{
	if ( (INT32)(m_ACC.d) >= 0 ) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bgz()
{
	if ( (INT32)(m_ACC.d) > 0 ) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bioz()
{
	if (S_IN(TMS32025_BIO) != CLEAR_LINE) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bit()
{
	GETDATA(0, 0);
	if (m_ALU.d & (0x8000 >> (m_opcode.b.h & 0xf))) SET1(TC_FLAG);
	else CLR1(TC_FLAG);
}
void tms32025_device::bitt()
{
	GETDATA(0, 0);
	if (m_ALU.d & (0x8000 >> (m_Treg & 0xf))) SET1(TC_FLAG);
	else CLR1(TC_FLAG);
}
void tms32025_device::blez()
{
	if ( (INT32)(m_ACC.d) <= 0 ) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::blkd()
{                                       /** Fix cycle timing **/
	if (m_init_load_addr) {
		m_PFC = M_RDOP_ARG(m_PC);
		m_PC++;
	}
	m_ALU.d = M_RDRAM(m_PFC);
	PUTDATA(m_ALU.d);
	m_PFC++;
	m_tms32025_dec_cycles += (1*CLK);
}
void tms32025_device::blkp()
{                                       /** Fix cycle timing **/
	if (m_init_load_addr) {
		m_PFC = M_RDOP_ARG(m_PC);
		m_PC++;
	}
	m_ALU.d = M_RDROM(m_PFC);
	PUTDATA(m_ALU.d);
	m_PFC++;
	m_tms32025_dec_cycles += (2*CLK);
}
void tms32025_device::blz()
{
	if ( (INT32)(m_ACC.d) <  0 ) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bnc()
{
	if (CARRY == 0) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bnv()
{
	if (OV == 0) SET_PC(M_RDOP_ARG(m_PC));
	else {
		m_PC++ ;
		CLR0(OV_FLAG);
	}
	MODIFY_AR_ARP();
}
void tms32025_device::bnz()
{
	if (m_ACC.d != 0) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bv()
{
	if (OV) {
		SET_PC(M_RDOP_ARG(m_PC));
		CLR0(OV_FLAG);
	}
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::bz()
{
	if (m_ACC.d == 0) SET_PC(M_RDOP_ARG(m_PC));
	else m_PC++ ;
	MODIFY_AR_ARP();
}
void tms32025_device::cala()
{
	PUSH_STACK(m_PC);
	SET_PC(m_ACC.w.l);
}
void tms32025_device::call()
{
	m_PC++ ;
	PUSH_STACK(m_PC);
	SET_PC(M_RDOP_ARG((m_PC - 1)));
	MODIFY_AR_ARP();
}
void tms32025_device::cmpl()
{
	m_ACC.d = (~m_ACC.d);
}
void tms32025_device::cmpr()
{
	switch (m_opcode.b.l & 3)
	{
		case 00:    if ( (UINT16)(m_AR[ARP]) == (UINT16)(m_AR[0]) ) SET1(TC_FLAG);
					else CLR1(TC_FLAG);
					break;
		case 01:    if ( (UINT16)(m_AR[ARP]) <  (UINT16)(m_AR[0]) ) SET1(TC_FLAG);
					else CLR1(TC_FLAG);
					break;
		case 02:    if ( (UINT16)(m_AR[ARP])  > (UINT16)(m_AR[0]) ) SET1(TC_FLAG);
					else CLR1(TC_FLAG);
					break;
		case 03:    if ( (UINT16)(m_AR[ARP]) != (UINT16)(m_AR[0]) ) SET1(TC_FLAG);
					else CLR1(TC_FLAG);
					break;
	}
}
void tms32025_device::cnfd()  /** next two fetches need to use previous CNF value ! **/
{
	CLR1(CNF0_REG);
	m_datamap[4] = &m_intRAM[0x200];            /* B0 */
	m_datamap[5] = &m_intRAM[0x280];            /* B0 */
	m_pgmmap[510] = NULL;
	m_pgmmap[511] = NULL;
}
void tms32025_device::cnfp()  /** next two fetches need to use previous CNF value ! **/
{
	SET1(CNF0_REG);
	m_datamap[4] = NULL;                        /* B0 */
	m_datamap[5] = NULL;                        /* B0 */
	m_pgmmap[510] = &m_intRAM[0x200];
	m_pgmmap[511] = &m_intRAM[0x280];
}
void tms32025_device::conf()  /** Need to reconfigure the memory blocks */
{
	switch (m_opcode.b.l & 3)
	{
		case 00:    CLR1(CNF1_REG); CLR1(CNF0_REG);
					m_datamap[4] = &m_intRAM[0x200];    /* B0 */
					m_datamap[5] = &m_intRAM[0x280];    /* B0 */
					m_datamap[6] = &m_intRAM[0x300];    /* B0 */
					m_datamap[7] = &m_intRAM[0x380];    /* B0 */
					m_datamap[8] = &m_intRAM[0x400];    /* B1 */
					m_datamap[9] = &m_intRAM[0x480];    /* B1 */
					m_datamap[10] = &m_intRAM[0x500];   /* B1 */
					m_datamap[11] = &m_intRAM[0x580];   /* B1 */
					m_datamap[12] = &m_intRAM[0x600];   /* B3 */
					m_datamap[13] = &m_intRAM[0x680];   /* B3 */
					m_datamap[14] = &m_intRAM[0x700];   /* B3 */
					m_datamap[15] = &m_intRAM[0x780];   /* B3 */
					m_pgmmap[500] = NULL;
					m_pgmmap[501] = NULL;
					m_pgmmap[502] = NULL;
					m_pgmmap[503] = NULL;
					m_pgmmap[504] = NULL;
					m_pgmmap[505] = NULL;
					m_pgmmap[506] = NULL;
					m_pgmmap[507] = NULL;
					m_pgmmap[508] = NULL;
					m_pgmmap[509] = NULL;
					m_pgmmap[510] = NULL;
					m_pgmmap[511] = NULL;
					break;

		case 01:    CLR1(CNF1_REG); SET1(CNF0_REG);
					m_datamap[4] = NULL;
					m_datamap[5] = NULL;
					m_datamap[6] = NULL;
					m_datamap[7] = NULL;
					m_datamap[8] = &m_intRAM[0x400];    /* B1 */
					m_datamap[9] = &m_intRAM[0x480];    /* B1 */
					m_datamap[10] = &m_intRAM[0x500];   /* B1 */
					m_datamap[11] = &m_intRAM[0x580];   /* B1 */
					m_datamap[12] = &m_intRAM[0x600];   /* B3 */
					m_datamap[13] = &m_intRAM[0x680];   /* B3 */
					m_datamap[14] = &m_intRAM[0x700];   /* B3 */
					m_datamap[15] = &m_intRAM[0x780];   /* B3 */
					m_pgmmap[500] = &m_intRAM[0x200];   /* B0 */
					m_pgmmap[501] = &m_intRAM[0x280];   /* B0 */
					m_pgmmap[502] = &m_intRAM[0x300];   /* B0 */
					m_pgmmap[503] = &m_intRAM[0x380];   /* B0 */
					m_pgmmap[504] = NULL;
					m_pgmmap[505] = NULL;
					m_pgmmap[506] = NULL;
					m_pgmmap[507] = NULL;
					m_pgmmap[508] = NULL;
					m_pgmmap[509] = NULL;
					m_pgmmap[510] = NULL;
					m_pgmmap[511] = NULL;
					break;

		case 02:    SET1(CNF1_REG); CLR1(CNF0_REG);
					m_datamap[4] = NULL;
					m_datamap[5] = NULL;
					m_datamap[6] = NULL;
					m_datamap[7] = NULL;
					m_datamap[8] = NULL;
					m_datamap[9] = NULL;
					m_datamap[10] = NULL;
					m_datamap[11] = NULL;
					m_datamap[12] = &m_intRAM[0x600];   /* B3 */
					m_datamap[13] = &m_intRAM[0x680];   /* B3 */
					m_datamap[14] = &m_intRAM[0x700];   /* B3 */
					m_datamap[15] = &m_intRAM[0x780];   /* B3 */
					m_pgmmap[500] = &m_intRAM[0x200];   /* B0 */
					m_pgmmap[501] = &m_intRAM[0x280];   /* B0 */
					m_pgmmap[502] = &m_intRAM[0x300];   /* B0 */
					m_pgmmap[503] = &m_intRAM[0x380];   /* B0 */
					m_pgmmap[504] = &m_intRAM[0x400];   /* B1 */
					m_pgmmap[505] = &m_intRAM[0x480];   /* B1 */
					m_pgmmap[506] = &m_intRAM[0x500];   /* B1 */
					m_pgmmap[507] = &m_intRAM[0x580];   /* B1 */
					m_pgmmap[508] = NULL;
					m_pgmmap[509] = NULL;
					m_pgmmap[510] = NULL;
					m_pgmmap[511] = NULL;
					break;

