mamedev/mame/src/emu/cpu/tms32025/tms32025.c
	save_item(NAME(m_intRAM));

	state_add( TMS32025_PC,   "PC",   m_PC).formatstr("%04X");
	state_add( TMS32025_STR0, "STR0", m_STR0).formatstr("%04X");
	state_add( TMS32025_STR1, "STR1", m_STR1).formatstr("%04X");
	state_add( TMS32025_IFR,  "IFR",  m_IFR).formatstr("%04X");
	state_add( TMS32025_RPTC, "RPTC", m_RPTC).formatstr("%02X");
	state_add( TMS32025_STK7, "STK7", m_STACK[7]).formatstr("%04X");
	state_add( TMS32025_STK6, "STK6", m_STACK[6]).formatstr("%04X");
	state_add( TMS32025_STK5, "STK5", m_STACK[5]).formatstr("%04X");
	state_add( TMS32025_STK4, "STK4", m_STACK[4]).formatstr("%04X");
	state_add( TMS32025_STK3, "STK3", m_STACK[3]).formatstr("%04X");
	state_add( TMS32025_STK2, "STK2", m_STACK[2]).formatstr("%04X");
	state_add( TMS32025_STK1, "STK1", m_STACK[1]).formatstr("%04X");
	state_add( TMS32025_STK0, "STK0", m_STACK[0]).formatstr("%04X");
	state_add( TMS32025_ACC,  "ACC",  m_ACC.d).formatstr("%08X");
	state_add( TMS32025_PREG, "P",    m_Preg.d).formatstr("%08X");
	state_add( TMS32025_TREG, "T",    m_Treg).formatstr("%04X");
	state_add( TMS32025_AR0,  "AR0",  m_AR[0]).formatstr("%04X");
	state_add( TMS32025_AR1,  "AR1",  m_AR[1]).formatstr("%04X");
	state_add( TMS32025_AR2,  "AR2",  m_AR[2]).formatstr("%04X");
	state_add( TMS32025_AR3,  "AR3",  m_AR[3]).formatstr("%04X");
	state_add( TMS32025_AR4,  "AR4",  m_AR[4]).formatstr("%04X");
	state_add( TMS32025_AR5,  "AR5",  m_AR[5]).formatstr("%04X");
	state_add( TMS32025_AR6,  "AR6",  m_AR[6]).formatstr("%04X");
	state_add( TMS32025_AR7,  "AR7",  m_AR[7]).formatstr("%04X");
	state_add( TMS32025_DRR,  "DRR",  m_debugger_temp).callimport().callexport().formatstr("%04X");
	state_add( TMS32025_DXR,  "DXR",  m_debugger_temp).callimport().callexport().formatstr("%04X");
	state_add( TMS32025_TIM,  "TIM",  m_debugger_temp).callimport().callexport().formatstr("%04X");
	state_add( TMS32025_PRD,  "PRD",  m_debugger_temp).callimport().callexport().formatstr("%04X");
	state_add( TMS32025_IMR,  "IMR",  m_debugger_temp).callimport().callexport().formatstr("%04X");
	state_add( TMS32025_GREG, "GREG", m_debugger_temp).callimport().callexport().formatstr("%04X");

	state_add(STATE_GENPC, "GENPC", m_PC).formatstr("%04X").noshow();
	/* This is actually not a stack pointer, but the stack contents */
	state_add(STATE_GENSP, "GENSP", m_STACK[7]).formatstr("%04X").noshow();
	state_add(STATE_GENFLAGS, "GENFLAGS",  m_STR0).formatstr("%33s").noshow();
	state_add(STATE_GENPCBASE, "GENPCBASE", m_PREVPC).formatstr("%04X").noshow();

	m_icountptr = &m_icount;
}


void tms32025_device::state_import(const device_state_entry &entry)
{
	switch (entry.index())
	{
		case TMS32025_DRR:
			M_WRTRAM(0, m_debugger_temp);
			break;

		case TMS32025_DXR:
			M_WRTRAM(1, m_debugger_temp);
			break;

		case TMS32025_TIM:
			M_WRTRAM(2, m_debugger_temp);
			break;

		case TMS32025_PRD:
			M_WRTRAM(3, m_debugger_temp);
			break;

		case TMS32025_IMR:
			M_WRTRAM(4,m_debugger_temp);
			break;

		case TMS32025_GREG:
			M_WRTRAM(5, m_debugger_temp);
			break;
	}
}


void tms32025_device::state_export(const device_state_entry &entry)
{
	switch (entry.index())
	{
		case TMS32025_DRR:
			m_debugger_temp = M_RDRAM(0);
			break;

		case TMS32025_DXR:
			m_debugger_temp = M_RDRAM(1);
			break;

		case TMS32025_TIM:
			m_debugger_temp = M_RDRAM(2);
			break;

		case TMS32025_PRD:
			m_debugger_temp = M_RDRAM(3);
			break;

		case TMS32025_IMR:
			m_debugger_temp = M_RDRAM(4);
			break;

		case TMS32025_GREG:
			m_debugger_temp = M_RDRAM(5);
			break;
	}
}


void tms32025_device::state_string_export(const device_state_entry &entry, std::string &str)
{
	switch (entry.index())
	{
		case STATE_GENFLAGS:
			strprintf(str, "arp%d%c%c%c%cdp%03x  arb%d%c%c%c%c%c%c%c%c%c%c%cpm%d",
				(m_STR0 & 0xe000) >> 13,
				m_STR0 & 0x1000 ? 'O':'.',
				m_STR0 & 0x0800 ? 'M':'.',
				m_STR0 & 0x0400 ? '.':'?',
				m_STR0 & 0x0200 ? 'I':'.',
				(m_STR0 & 0x01ff),

				(m_STR1 & 0xe000) >> 13,
				m_STR1 & 0x1000 ? 'P':'D',
				m_STR1 & 0x0800 ? 'T':'.',
				m_STR1 & 0x0400 ? 'S':'.',
				m_STR1 & 0x0200 ? 'C':'?',
				m_STR0 & 0x0100 ? '.':'?',
				m_STR1 & 0x0080 ? '.':'?',
				m_STR1 & 0x0040 ? 'H':'.',
				m_STR1 & 0x0020 ? 'F':'.',
				m_STR1 & 0x0010 ? 'X':'.',
				m_STR1 & 0x0008 ? 'f':'.',
				m_STR1 & 0x0004 ? 'o':'i',
				(m_STR1 & 0x0003)
			);
			break;
	}
}


/****************************************************************************
 *  Reset registers to their initial values
 ****************************************************************************/
void tms32025_device::device_reset()
{
	SET_PC(0);                  /* Starting address on a reset */
	m_STR0 |= 0x0600;   /* INTM and unused bit set to 1 */
	m_STR0 &= 0xefff;   /* OV cleared to 0. Remaining bits undefined */
	m_STR1 |= 0x07f0;   /* SXM, C, HM, FSM, XF and unused bits set to 1 */
	m_STR1 &= 0xeff0;   /* CNF, FO, TXM, PM bits cleared to 0. Remaining bits undefined */
	m_RPTC = 0;         /* Reset repeat counter to 0 */
	m_IFR = 0;          /* IRQ pending flags */

	S_OUT(TMS32025_XF,ASSERT_LINE); /* XF flag is high. Must set the pin */

	/* Set the internal memory mapped registers */
	GREG = 0;
	TIM  = 0xffff;
	PRD  = 0xffff;
	IMR  = 0xffc0;

	m_idle = 0;
	m_hold = 0;
	m_tms32025_dec_cycles = 0;
	m_init_load_addr = 1;

	/* Reset the Data/Program address banks */
	memset(m_pgmmap, 0, sizeof(m_pgmmap));
	memset(m_datamap, 0, sizeof(m_datamap));

	m_datamap[0] = &m_intRAM[0x000];            /* B2 */
	m_datamap[4] = &m_intRAM[0x200];            /* B0 */
	m_datamap[5] = &m_intRAM[0x280];            /* B0 */
	m_datamap[6] = &m_intRAM[0x300];            /* B1 */
	m_datamap[7] = &m_intRAM[0x380];            /* B1 */
}

void tms32026_device::device_reset()
{
	tms32025_device::device_reset();

	m_datamap[8] = &m_intRAM[0x400];            /* B1 */
	m_datamap[9] = &m_intRAM[0x480];            /* B1 */
	m_datamap[10] = &m_intRAM[0x500];           /* B1 */
	m_datamap[11] = &m_intRAM[0x580];           /* B1 */
	m_datamap[12] = &m_intRAM[0x600];           /* B3 */
	m_datamap[13] = &m_intRAM[0x680];           /* B3 */
	m_datamap[14] = &m_intRAM[0x700];           /* B3 */
	m_datamap[15] = &m_intRAM[0x780];           /* B3 */
}


/****************************************************************************
 *  Issue an interrupt if necessary
 ****************************************************************************/
int tms32025_device::process_IRQs()
{
	/********** Interrupt Flag Register (IFR) **********
	    |  5  |  4  |  3  |  2  |  1  |  0  |
	    | XINT| RINT| TINT| INT2| INT1| INT0|
	*/

	m_tms32025_irq_cycles = 0;

	/* Dont service Interrupts if masked, or prev instruction was EINT ! */

