mamedev/mame/src/emu/cpu/tms32025/tms32025.c
	switch (spacenum)
	{
		case AS_PROGRAM:
			ptr = m_pgmmap[offset >> 8];
			if (!ptr)
				return 0;
			break;

		case AS_DATA:
			ptr = m_datamap[offset >> 8];
			if (!ptr)
				return 0;
			break;

		default:
		case AS_IO:
			return 0;
	}

	switch (size)
	{
		case 1:
			value = ((UINT8 *)ptr)[BYTE_XOR_BE(offset & 0xff)];
			break;
		case 2:
			value = ((UINT16 *)ptr)[(offset & 0xff) / 2];
			break;
		case 4:
			memory_read(spacenum, offset + 0, 2, temp);
			value = temp << 16;
			memory_read(spacenum, offset + 2, 2, temp);
			value |= temp & 0xffff;
			break;
		case 8:
			memory_read(spacenum, offset + 0, 4, temp);
			value = temp << 32;
			memory_read(spacenum, offset + 4, 4, temp);
			value |= temp & 0xffffffff;
			break;
	}
	return 1;
}


/****************************************************************************
 *  Memory writer
 ****************************************************************************/
bool tms32025_device::memory_write(address_spacenum spacenum, offs_t offset, int size, UINT64 value)
{
	void *ptr = NULL;

	switch (spacenum)
	{
		case AS_PROGRAM:
			ptr = m_pgmmap[offset >> 8];
			if (!ptr)
				return 0;
			break;

		case AS_DATA:
			ptr = m_datamap[offset >> 8];
			if (!ptr)
				return 0;
			break;

		default:
		case AS_IO:
			return 0;
	}

	switch (size)
	{
		case 1:
			((UINT8 *)ptr)[BYTE_XOR_BE(offset & 0xff)] = value;
			break;
		case 2:
			((UINT16 *)ptr)[(offset & 0xff) / 2] = value;
			break;
		case 4:
			memory_write(spacenum, offset + 0, 2, value >> 16);
			memory_write(spacenum, offset + 2, 2, value);
			break;
		case 8:
			memory_write(spacenum, offset + 0, 4, value >> 32);
			memory_write(spacenum, offset + 4, 4, value);
			break;
	}

	return 1;
}
